[
  {
    "id":1,
    "context":"alternate_viewpoints_perspectives: A parallel argument would state that England is worse off because America passed them as the dominant economic power in the world. Is the argument remotely true? Not at all - England has become far wealthier from trade with America. I'm typing this reply on a Samsung phone, made in Korea, which was an undeveloped country in the not too distant past. Who knows, maybe Vietnam has some kids now who will figure out a better smartphone. I'd love it if they became wealthy enough to actually make one. Your argument is essentially mercantilist, by thinking that trade is zero-sum, but actually trade improves income for all nations.",
    "question":"What about nations who have nothing?",
    "context_token_len":126,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":2,
    "context":"alternate_viewpoints_perspectives: It would be cringe because trump's policies (and other things) are extremely at odds with theirs. But fair enough. If you don't think it would be cringe for trump I can understand why it wouldn't be cringe for biden either.",
    "question":"If not, what about this is cringe exactly?",
    "context_token_len":50,
    "is_Critical":false,
    "CauseToEffect":5.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":3,
    "context":"alternate_viewpoints_perspectives: I do not understand how this significantly changes the FOI act. If the line granting immunity specifically to body cam footage as outlined in the specific bill OP is advocating for is injected into the Act I do not see how any unintended consequences could occur.",
    "question":"What about public surveillance cameras?",
    "context_token_len":50,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":4,
    "context":"alternate_viewpoints_perspectives: There is a tremendous amount of overlap between high school curriculum and the core college curriculum in the United States. Many school are combating this by offering a wide variety of college level (AP and IB) and duel credit classes to allow ambitious students to get ahead. AP classes are great, but they teach to a test and are very formulaic. If a student has a real passion for a subject, they might miss it in the droll high school environment. For students who aren't up for the challenge of an AP or duel credit class (or for students who attend schools that don't offer these options), they often hear the same material twice: once in their high school level class and once in their college level class. There is no reason why a student would need to take two virtually identical government classes or two statistic classes in a two year window. By eliminating the last two years of high school, students will be spared the redundancy. Instead of making teenagers jump into college, technical school or their careers, making them serve their country either through military or civil service would allow them to gain real life experience.",
    "question":"How about allowing some students to go straight into college instead of joining the military?",
    "context_token_len":222,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":3.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":5,
    "context":"alternate_viewpoints_perspectives: You consider yourself a feminist. But judging by your post, your definition of feminism is fairly simple and concerns matters of 2nd Wave Feminism such as equal treatment in both legal and social ways between men and women. Pretty much the entirety of the population of most developed country think like this. In 2017 believing in equality between men and women does not make you a \"feminist\", especially if you hate women. Feminism has changed. The main problems raised by modern feminists shifted when they saw that men and women are equal in the eye of the law and the huge majority of the population. Your justification for identifying as a feminist is that \"women are equal to men in every respect and they should be treated as such\".",
    "question":"What else do you imagine is necessary to be considered a feminist?",
    "context_token_len":144,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":6,
    "context":"alternate_viewpoints_perspectives: Okay, this sounds like a very pessimistic and ignorant way of looking at things, but I just can't shake the idea that people are not loyal enough to their partners to not be able to cheat on them at some point during a long term relationship. I would like to believe this isn't the case but I have seen infidelity among so many of my friends and have read so many stories of cheating taking place online that it makes me lose hope in the future of my relationships and romantic relationships as a whole. And then I look at divorce rates and how long a lot of marriages last and I become even more discouraged.",
    "question":"What about the divorce rate concerns you?",
    "context_token_len":125,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":7,
    "context":"alternate_viewpoints_perspectives: If your targets are churches, schools and apartments, the majority of your targets are inside. Meaning that if you were just doing drive-by molotov cocktails, you wouldn't hit much of anyone without getting into your car Why do you need to hit them directly? Just burn the only entrances and exits If you did do this, you would be pretty easy to nail down and engage for the police via car-chase. Compared to the 15 minute police response time for the vegas shooter? If you did try to do this with a crowded group of people outdoors (street party, etc.) don't your police force already have a perimeter set up for such an occasion? (doubly so with the \"ram a truck into crowd\" tactic that has become very popular).",
    "question":"Are there other means of killing people?",
    "context_token_len":155,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":8,
    "context":"alternate_viewpoints_perspectives: President Obama has faced a large opposition in the Republican party. Despite this, he has stopped the second great depression created a health care overhaul and presided over tremendous job creation.",
    "question":"So what about the first few years of his time in office when the democrats had both the house and senate?",
    "context_token_len":36,
    "is_Critical":false,
    "CauseToEffect":4.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":9,
    "context":"alternate_viewpoints_perspectives: While there is suffering, I won't call it cruelty as cruelty involves some sort of intention to cause suffering. Suffering happens, such as when a predator attempts to find food and starts eating it's prey before the prey is dead, but suffering was not the intent. Eating was the intent. Cruelty is more the case when the intent is to cause suffering or is known to cause suffering and the suffering is ignored. Such would be the case where a person kicks a dog, or instead of killing an animal quickly and humanely they intentionally let it suffer (the predator animal has no clue about the suffering the prey goes through).",
    "question":"What about when cats and other animals toy with their prey?",
    "context_token_len":126,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":10,
    "context":"alternate_viewpoints_perspectives: It’s not “another man”, it’s multiple men around the world, in every country. Men are far too violent\/toxic and it costs thousands of girls and women their lives everyday.",
    "question":"What about the woman that kill men?",
    "context_token_len":41,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":11,
    "context":"alternate_viewpoints_perspectives: Almost anything in the world is abusable. We shouldn’t ban everything that can be abused, especially if it might have great benefits.",
    "question":"So what can we ban or say no to ?",
    "context_token_len":28,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":2.5,
    "ExpertOpinion":3.0,
    "FearAppeal":5
  },
  {
    "id":12,
    "context":"alternate_viewpoints_perspectives: Backstory: I'm a 17 year old male in high school. I'm not opposed to sex but I do find open discussion about sex to be disturbing and perverse. I recognize this is probably wrong and that I should be open to expierence but I can't shake the feeling of disgust when someone starts talking about sexual desires or fetishes. I am a virgin and I'm not opposed to losing my viriginity but I want it to be with the right person and all that cheesy stuff. Being male and a teenager I'm constantly submerged in sexual covernsation with male and female alike but I still think it's private and should be kept private.",
    "question":"What are other things that should be kept private according to you?",
    "context_token_len":127,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":2.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":13,
    "context":"alternate_viewpoints_perspectives: I've been in relationships where the girl constantly wanted me to change. Like she wanted me to not spend alot of time with my friends, She wanted me to eat meat, she wanted me not workout everyday, she wanted me to not play video games. It was horrible. I love doing what I do. I think she is selfish for wanting me to change in a way I don't accept. I broke up with her for this reason.",
    "question":"Have you considered that these were things she brought to you because she thought that you were giving your friends and video games more attention than the relationship?",
    "context_token_len":91,
    "is_Critical":false,
    "CauseToEffect":5.5,
    "Analogy":4.0,
    "ExpertOpinion":4.0,
    "FearAppeal":4
  },
  {
    "id":14,
    "context":"alternate_viewpoints_perspectives: To answer your questions: - Totally acceptable the other way around. My wife can appreciate a good topless view as much as anyone. - I don't recall it being any different when we first started dating, and it doesn't really only happen far away from home. We're just not jealous people... So I guess I just can't picture your side of the argument. I don't find it disrespectful. - For the last question, it doesn't even matter if it's someone we know - to be honest. My wife could tell me that she thought one of my friends looked especially hot on a given day and I wouldn't even give it a second thought.",
    "question":"Or go into detail on which body part she thought was hot?",
    "context_token_len":135,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":15,
    "context":"alternate_viewpoints_perspectives: The title pretty much sums it up, but I find it selfish when anyone in front of my (or anyone else) reclines their seat in an airplane because it directly impacts the space of the person behind. So sure, the person behind has the option to recline, too, and it is their 'choice' to do so, but what if they just want to remain straight and have the space in front of them? To illustrate that the reclining person is using other people's space: what if all seats started off reclined and people had the option to move forward to an upright position? They can move forward and impact their own space (thus having less space in front of them) without impacting anyone else. For the purpose of this CMV, I'm ignoring external factors such as medical conditions (because these do not impact your average flight) Hello, users of CMV!",
    "question":"What about red eye flights?",
    "context_token_len":175,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":16,
    "context":"alternate_viewpoints_perspectives: I'm more or less on the fence with this issue, BUT I see many points raised by anti-reparations proponents to be seemingly valid. First, I am not using the common argument against reparation of \"I didn't do anything, why should I pay?\". But I am having trouble disagreeing with the view of \"Neither I nor my ancestors did anything, why should I pay?\". This would be in line with the views of white people with immigrant ancestors (who also went through hardships and discrimination) who did not partake in slavery or discrimination in any form. I often see the comparison of paying reparations to the Jews by Germany and I find that different since those reparations were made shortly after AND everyone or their ancestors in Germany either was a Nazi-supporter or silently compliant during the genocides. I know reparations in the U.S. are as much about slavery as they are about recent discrimination from the 1900s. But, it's been long enough that not everyone was around or had ancestors around in the U.S. during that time, and even for those who did, their ancestors weren't necessarily silently compliant -- they may have even marched with African Americans to get them their rights. So, why should someone, particularly descendants of immigrants, have to effectively pay reparations to African Americans.",
    "question":"What about the Euopeans who lent the US massive ships allowing them to take 10 times as many slaves back from Africa?",
    "context_token_len":255,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":6.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":17,
    "context":"alternate_viewpoints_perspectives: OK, I am very worried about the state of the United States of America's government and, particularly, I'm worried about our current President, Donald Trump. I am NOT trolling. What I would like to hear from a Trump supporter is that, as a leftist who is concerned about human rights, economic justice, and science-based policy, why should I NOT worry about the current Presidency? President Trump seems to be running a chaotic White House which is, nevertheless, rolling back measures (like taxation on the wealthy) that have served our country well.",
    "question":"Are there any concerning events outside of you preferring Democratic policies?",
    "context_token_len":113,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":18,
    "context":"alternate_viewpoints_perspectives: Suppose I say \"Ability to deadlift has no correlation with strength. People who are able to run a four minute mile are much stronger than people who are excellent deadlifters.\"",
    "question":"What about gymnasts?",
    "context_token_len":36,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":19,
    "context":"alternate_viewpoints_perspectives: As the post says, I am having serious doubts about the gender I was born into and have been feeling for the past few years that I am MTF. However, I don't think that I will ever come out and carry on living a lie for as long as I can. I know that my partner would be crushed and I woukd lose her (she's 100% hetero), my folks wouldn't get it and I may lose them and I doubt I will keep my job. Typical advice on websites, forums etc dictates that you should transition because it will otherwise be unbearable but honestly I think that the hurt to the ones you love is strong enough that living a life not true to yourself is kinder to others. Plus it can destroy careers and even be unsafe. I propose in cases like mine, it's ok and preferable to stay \"in the closet\" as it were and that no one should be obligated to behave how others propose.",
    "question":"Have you considered talking to a mental health professional?",
    "context_token_len":190,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":4.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":20,
    "context":"alternate_viewpoints_perspectives: Are banks racists? How about airports? Or even your local liquor store? All three require some form of photo ID. The right to fly, the right invest money in a bank, and the right to buy liquor are not enshrined in the constitution as part of how we determine our government.",
    "question":"How about the right to own private property?",
    "context_token_len":60,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":21,
    "context":"alternate_viewpoints_perspectives: So first off I don't think that the election is rigged or anything like that, just that one vote won't change it. First I'll talk about the presidential election, but I'll get to the down ballot stuff in a moment.",
    "question":"What did everyone else do on election day?",
    "context_token_len":50,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":22,
    "context":"alternate_viewpoints_perspectives: I believe that hyper-realistic paintings involve huge amount of skill and effort, but the end result is something that can be obtain through other means: you can print a photo or you can literally have a special printer that transposes that photo through micro brush strokes. All in all, it feels like hand-pressing your clothes to iron out the wrinkles. You get almost the same result as ironing, but you spend much more time and effort. That time and effort in itself does not make it more artistic.",
    "question":"What else should the artist do?",
    "context_token_len":102,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":23,
    "context":"alternate_viewpoints_perspectives: Meh, why carry gun when you can get others to carry for you? Strength = any kind of strength, not just brute force.",
    "question":"So what other strength do guns give you other than brute force?",
    "context_token_len":29,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":24,
    "context":"alternate_viewpoints_perspectives: if it would be immoral, then it would also be immoral to deny them at the borders anyways. If a sick person shows up at the border in immediate help, is that something you're willing to deny? Either you need to be willing to deny things you aren't it remains the case that it's a possible option. birthright citizenship isn't a big loophole it's a pretty typical feature. It shouldn't affect things if they were born and raised here, since then they are'nt immigrants at all, but natives.",
    "question":"Who is to say this person is an immigrant or not?",
    "context_token_len":105,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":25,
    "context":"alternate_viewpoints_perspectives: Right parents have children with the intent that they are born healthy and are able to live out a healthy life but there are children who are born that live very painful and short lives and that is all part of the risk. I don't think the parents have the right to take that risk.",
    "question":"Or at least reasonable that other people would want to take that risk?",
    "context_token_len":60,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":26,
    "context":"alternate_viewpoints_perspectives: Perhaps there is someone who’s made a vague allusion to the Russia thing, but I’d love to see a source on a member of Congress jumping in with both feet like the q lady or the gun lady. As for #2, that’s not actually what people believe or what the statistic is. I’m sure you’ll find plenty of members who believe the gender pay gap is wrong, but that’s not the conspiracy. The gender pay gap is a fact - on average women are paid less than men. The conspiracy is whether there are a group of elites controlling this process. Most people who talk about this discuss unconscious bias and the effect of pregnancy on career opportunities. But if you can find members who believe the conspiracy you’re referring to then let’s hear it.",
    "question":"How about the entire democrat party including their candidate Hillary Clinton claiming the election was stolen from her through Russian collusion?",
    "context_token_len":156,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":4.0,
    "FearAppeal":2
  },
  {
    "id":27,
    "context":"alternate_viewpoints_perspectives: He better build the wall. If people wanted to repeal the Patriot act and what I see as unconstitutional and therefore illegal surveillance they would need to organize and not vote for anyone who doesn't promise to fight for the cause.",
    "question":"What about peaceful protesting?",
    "context_token_len":46,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":28,
    "context":"alternate_viewpoints_perspectives: I want to know how her being shot can be unjustifiable. If I see the reasoning, then maybe my stance can soften.",
    "question":"What reasoning could there be?",
    "context_token_len":27,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":2.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":29,
    "context":"alternate_viewpoints_perspectives: In my personal experience, I have found that the general perception within American society is that weighing two cultures against each other is considered ignorant and morally wrong, because each culture has their own inherent value. While I do believe that every culture has some subjective value in some sense, I also believe that there are objective ways to determine the superiority or inferiority of a culture, and that using certain guidelines, it is clear that certain cultures are superior to others. Cultural relativism has become the sociological norm when evaluating the perceived value of a culture, but this view completely disregards the aspects that make other societies great. To determine the value of a society, I believe there are three main determinants: Cultures that value reason and logic over faith or mysticism have pioneered advancements in countless fields (modern medicine, biology, philosophy, astronomy, chemistry, etc. ), whereas cultures that prioritize religion and associated beliefs have predominantly relied on other cultures to make progress.",
    "question":"What about culture that value the harmony with the group?",
    "context_token_len":186,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":30,
    "context":"alternate_viewpoints_perspectives: For some context, I am a high school student in the US, at a school that takes sports pretty seriously(several state championships and such) I don't do any sports at my school, (I do competitive shooting and a lot of lifting outside my school) but I feel my argument still applies to club sports for people sub 18: Sports for people under 18 are taken way to seriously, and many people need to reconsider what we are doing to these kids These sports take up way too much of there time for something they will be lucky to be able play these things in collage, yet alone past that. Most sports during and months prior to their season have practice 5 times a week, and often 6. And these are many hour long practices, taking up there whole evening.",
    "question":"Or what about a theater kid who spends significant amounts of time preparing and rehearsing?",
    "context_token_len":156,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":31,
    "context":"alternate_viewpoints_perspectives: I haven't said anything about political parties. Republican, democrat, libertarian, regardless of someone's party or views, I believe there should be a cutoff because they're making decisions that will likely not directly affect them. To me, it's like someone moving away. If I grew up in one state my entire life, then decide to leave and move elsewhere, why would I vote on the bills and laws and governors during my last year or two? It takes time for effects to trickle down and the changes that would be made will not affect me anyway. I mentioned I was flexible on the age window, I know people often live into their 90's and over. The average life expectancy in America is somewhere around 80, so I was working off that. Alzheimer's is but only one subcategory under the dementia umbrella.",
    "question":"What other categories of dementia would we include?",
    "context_token_len":165,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":32,
    "context":"alternate_viewpoints_perspectives: ?? Even then they have a point. Protests that incorporate patriotism and symbols of Americana as reasons you should support the protest are far more likely to be well received than protests that shun or don't incorporate them.",
    "question":"What is more patriotic than using the symbols of the country to exercise their rights and fight injustice?",
    "context_token_len":44,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":33,
    "context":"alternate_viewpoints_perspectives: As many have noticed PETA has been making inflammatory statements that have brought them into focus again. As anyone could predict, Reddit and other social media sites have been inundated with screenshots and reactions to the posts. This is exactly what PETA wanted and they've executed their plan perfectly. These days having 10,000 unstable but motivated people behind a keyboard is more effective than 1,000,000 apathetic people who aren't going to do anything to actually further a cause.",
    "question":"Is that not a more powerful argument for this being a successful campaign?",
    "context_token_len":87,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":34,
    "context":"alternate_viewpoints_perspectives: I'm transgender (male to female). My personal belief is that a blood test should be necessary to allow MTF transgender kids to compete with cis girls. FTM transgender kids wouldn't need to do this, as their hormone levels would never be able to create a physical advantage over their teammates and opponents. The blood test would have to show that their testosterone levels are closer to that of a female than a male. The simplest way to put it: Testosterone is a PED.",
    "question":"What about cis women who just naturally have higher testosterone levels?",
    "context_token_len":96,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":35,
    "context":"alternate_viewpoints_perspectives: Recently I have decided I do not see myself as a member of a particular nation but rather I identify myself as a citizen of the world. I am from the USA but I prefer to be called a world citizen or an earthling. You can choose between those two. Just by talking to people on the internet I see no reason to compete with these people from foreign countries. And also just by talking on the internet I see no reason to have a unique loyalty to \"Americans\".",
    "question":"When else do you identify as American?",
    "context_token_len":98,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":6.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":36,
    "context":"alternate_viewpoints_perspectives: Like born with hermaphroditism? If you can show me that this is the case for a large number of transgender individuals I would be inclined to reconsider.",
    "question":"What about trans people who were assigned female at birth?",
    "context_token_len":31,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":37,
    "context":"alternate_viewpoints_perspectives: I think that before you're 18 your parents should monitor who you're having relationships with, so it's up to them if they're willing to tolerate it. If parents approve because a guy isn't abusive and is a good partner, it's not my business. If it was my daughter, I would prefer her not to date a man that's much older because of my views on what a relationship\/family should be.",
    "question":"And what about the parents who coerce their 16 year old daughter into marrying a 40 year old man of their choice?",
    "context_token_len":87,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":38,
    "context":"alternate_viewpoints_perspectives: 1)A racist believes the suffering of his\/her\/their race takes priority over the suffering over another race. The lexical definition of discrimination: distinguishing one category from another based on a standard. A racist discriminates against other races based on the standard of skin color. This is as superficial, figuratively and literally, as it gets. Despite how ridiculously erroneous it may be, it’s rationally consistent.",
    "question":"But who are you to say that a standard is true or false?",
    "context_token_len":79,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":39,
    "context":"alternate_viewpoints_perspectives: I contend there exists no exhaustive true-or-false definition, even in strictly biological terms, of what a woman is such that it would include all individuals that are women and exclude all those who are not in a systematic and meaningful way. I'll work just with women for the sake of brevity here, but I think this goes for both existing sex categories. I'll provide some examples of definitions that simply don't work or are incompatible t with a view of two clean-cut immutable biological categories.",
    "question":"Does anything other than pure mathematical objects have an exhaustive definition in this sense?",
    "context_token_len":102,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":40,
    "context":"alternate_viewpoints_perspectives: I see this on both the left and the right, although the phrasing is different. From the left it's \"It's not my job to educate you\" and from the right it's \"Go do your own research, I did mine.\" The whole point of activism is to enact change. That won't happen unless you get people on your side when they go to the voting booth, and that won't happen if you won't tell them what your point of view even is or why they should support your cause. If you're not going to try to further a movement, you should go home because you're in the way of the people actually doing the educating and doing the research you're too lazy to do.",
    "question":"Or trying to educate the people who might actually want to be educated?",
    "context_token_len":147,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":41,
    "context":"alternate_viewpoints_perspectives: A Muslim wearing Muslim garb is not removing that garb from it's context in the slightest. Your examples were therefore poor and inapplicable.",
    "question":"Can you do anything other than just restate your unfounded argument?",
    "context_token_len":28,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":42,
    "context":"alternate_viewpoints_perspectives: Every police officer should have a body cam on their person during their shifts, the cameras should be running the entire time they are on duty, and the unedited unabridged footage should be uploaded to a cloud server and available immediately or the next day at the latest. We shouldn't have to wait until September to see what happened in an incident back in March. The police are public servants and should not be doing anything questionable on duty that they wouldn't want people to see.",
    "question":"What about the privacy of the people that the police interact with?",
    "context_token_len":95,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":43,
    "context":"alternate_viewpoints_perspectives: In the past it was only used if someone was too drugged or drunk to physically remove themselves from the situation, and usually the perp had the intention of getting them drunk or drugged for this purpose, or found them in that state and took advantage of the situation. Now it's used in situations where someone willingly has sex while under the influence. In my opinion the line should be if the perp created or took advantage of a situation where the victim was not free to leave the situation. That could be done with physical force or drugs or alcohol. If someone gets themselves drunk and chooses to have sex they weren't raped.",
    "question":"Where outside of some sort of extremely fringe interpretation is it automatically rape if two drunk people have sex?",
    "context_token_len":125,
    "is_Critical":false,
    "CauseToEffect":5.0,
    "Analogy":4.0,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":44,
    "context":"alternate_viewpoints_perspectives: That's well in good in Canada - US example. Balanced economies uplift each other. But what about US - Mexico? Not all countries are exactly balanced that way. They are stable, yes, because they can't import more than they eart from export (not exactly, but just being simplistic), but poor country doesn't get elevated to a level of rich country by passive trade with them. And especially not by people personally shopping over border.",
    "question":"Why else do you think people take foreign currency?",
    "context_token_len":91,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":45,
    "context":"alternate_viewpoints_perspectives: How are you using rioters against me when I don’t support them? Please explain. You literally quoted the last thing I said when my whole response was saying that hose were opportunists and they were wrong to riot. I also said not to mix them with the peaceful protestors. But you come to me saying that I held rioters up as an alternative to kneeling. I don’t support rioters , is that clear? It’s hard to respond to everything else you’ve said when you just blatantly lie on what I’ve said.",
    "question":"What about that are you not understanding?",
    "context_token_len":105,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":46,
    "context":"alternate_viewpoints_perspectives: The things you list aren't actually prostitution. They're not transactional in the same way. For instance, going for a sugar daddy\/mommy.",
    "question":"And what about porn?",
    "context_token_len":31,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":47,
    "context":"alternate_viewpoints_perspectives: Those sources aren't about specific emotions relating to sex, but levels of emotionality relating to gender (spoiler, gender != sex). And they both address it at the psychological level, not the biological one. So what you've effectively proven, in a discussion about toxic masculinity and how it stunts emotional growth and expression in men, is that men are less emotionally grown and expressive. Good job, you just played yourself. You're so busy trying to \"beat the feminists\" that you can't even see your own sources contradict you.",
    "question":"But its not like feminists care about boys and that men being bullied as women have it worse right?",
    "context_token_len":109,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":6.0,
    "ExpertOpinion":0.0,
    "FearAppeal":5
  },
  {
    "id":48,
    "context":"alternate_viewpoints_perspectives: The female body is responsible for keeping the species alive. As far as reproducing goes, the female body is designed to do 99.9% of the work.",
    "question":"Would it be possible to find another arguement that does not involve reproduction?",
    "context_token_len":32,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":49,
    "context":"alternate_viewpoints_perspectives: My world view is there are only two genders. You can choose to be the gender you were born as, or as the other gender. I've read a bit about this subject and talked to a gender fluid person about it, but I still don't understand.",
    "question":"What about intersex people?",
    "context_token_len":55,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":50,
    "context":"alternate_viewpoints_perspectives: Not an anarchist, but I'm willing enough to play devil's advocate here, since there's definitely a lot of good arguments in favor of anarchy. I think the best is the capitalistic branch of anarchy. In the absence of government, it wouldn't be a free-for-all people would seek other arrangements to secure their basic rights. For example, a lot of the rules in neighborhoods today aren't laws. Many neighborhoods require that, for someone living there, that person has to have a well-kept lawn, to maintain property value. There's no law stating that-- the people in the neighborhood just decided that such a rule was in their favor. Likewise, in the absence of government, such organizations would expand. When living in a neighborhood, part of the rules would require basic things like no theft, as well as guaranteeing ownership of that house.",
    "question":"What about impoverished and or gang heavy areas?",
    "context_token_len":173,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":1.0,
    "FearAppeal":2
  },
  {
    "id":51,
    "context":"alternate_viewpoints_perspectives: You are assuming he went there to kill people destroying property. If he did, he would have shot a lot more people than he did, so that point seems prima facie silly. You are attempting to attach a motive to him for which there is no evidence, armed security works as a deterrent, simply because you have people with guns outside your business does not mean you are hiring people to shoot your customers. Kyle had the gun to defend himself should it become necessary, there’s no evidence he intended to shoot people committing property crimes, and he did no such thing anyways, so I’m not sure how it’s relevant. Was he supposed to drop the gun? Or just sling it on his back? He was just attacked and was being pursued, someone having a gun does not give you the ability to wantonly attack them.",
    "question":"How else will he protect property owners with his gun aside from shooting people?",
    "context_token_len":166,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.5,
    "ExpertOpinion":0.0,
    "FearAppeal":4
  },
  {
    "id":52,
    "context":"alternate_viewpoints_perspectives: Because that word has always meant the union of a man and a woman since the words inception. Not a man and man or a woman and a woman but a man and a woman.",
    "question":"What about making the man and woman legally equals in the relationship?",
    "context_token_len":39,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":4
  },
  {
    "id":53,
    "context":"alternate_viewpoints_perspectives: In the legal definition there is the idea of forced labor, or comporting someone's will to yours. This idea of the use of force against someone is intrinsically moral, notably the use of force against another is intrinsically immoral in most circumstances. The dictionary definition is merely total dependence. It lacks that same dimension of force. Most people don't force their cats to do anything beyond exist.",
    "question":"And what about animals that are forced to do things until they learn to do it without force?",
    "context_token_len":78,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":4
  },
  {
    "id":54,
    "context":"alternate_viewpoints_perspectives: Despite being necessary to the functioning of our economy, if you work one of these cursed jobs you deserve poverty because obviously you made bad choices A low-tier worker does not need to be poor. The point of saying that you shouldn't want a low-tier job forever isn't that those are \"bad\" jobs that indicate failure, it's because those jobs are not compatible with the kind of lifestyle you are trying to live. If you WANT to live with your parents or two roommates, with a beater car and pirated music, then that's a perfectly viable option. That's the baseline. But if you want a better life than that eventually, as literally everyone does, then it requires a \"better\" job that pays you accordingly.",
    "question":"What about just keeping up with bills?",
    "context_token_len":150,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":55,
    "context":"alternate_viewpoints_perspectives: People are forced into interactions. I'm not saying I go around avoiding people till they respect me. I'm saying their interactions with me build a mutual respect, a disinterest or an annoyance.",
    "question":"Or would you treat the other one with enough respect to gain their respect?",
    "context_token_len":40,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":56,
    "context":"alternate_viewpoints_perspectives: From my understanding, historically, once a population experiences liberal freedom(especially 100 years of it), it's virtually impossible to force the population to accept an illiberal government, especially when the population is as large and as educated as Hong Kong's. The more China suppresses and tries to control Hong Kong, the more Hong Kong is going to resist the control to give up its liberal freedom.",
    "question":"Do you see any protests in any other cities than Hong Kong?",
    "context_token_len":77,
    "is_Critical":false,
    "CauseToEffect":4.0,
    "Analogy":4.0,
    "ExpertOpinion":2.0,
    "FearAppeal":4
  },
  {
    "id":57,
    "context":"alternate_viewpoints_perspectives: This is essential how it works already... (I know Polish, Danish and Dutch system). Universal healthcare guarantees certain basic level of care. But if you can afford, there are tons of additional private insurances one can get on top of that.",
    "question":"But then again you still have to pay for others?",
    "context_token_len":51,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":58,
    "context":"alternate_viewpoints_perspectives: To understand what I mean here, imagine this future scenario: Great Britain, after many years of post-Christian adolescence, returns to the Christian faith. This is not a top-down transformation imposed by a Christian government, but a broad and powerful social transformation. People start identifying as Christian again there's a demand for new churches there's a shift towards Christian values. Cultural production responds with art, music, TV shows, movies etc promoting a Christian worldview. Once again, this is not a question of government mandate.",
    "question":"What about enforcing headwear on women ?",
    "context_token_len":105,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":59,
    "context":"alternate_viewpoints_perspectives: Regardless of your political leaning I hope you can agree that impeachment should not be used as a mere political tactic. The will of the American voters should be held to a higher standard, a political party should not be able to use impeachment because of their disdain for a president. I believe as if the Democrats are using this impeachment as a political tool in hopes of swaying the 2020 election. I think impeachment is not warranted and many of the Democrats who voted for this know this as well. I think by moving forward with this impeachment the Democrats have set an absolutely horrible precedent moving forward. For example, filibustering used to be a rare tactic only to be used in the most niche of situations. But, now after years of misuse and abuse it has now become a commonplace occurrence. This is going to start happening with impeachment now.",
    "question":"What other mechanism for accountability are you thinking of?",
    "context_token_len":165,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":60,
    "context":"alternate_viewpoints_perspectives: I think you might be begging a question here by assuming that Warren is a substitute for Sanders. Personally, I have no animosity toward Sanders, and will vote for him if he's nominated. I support Warren because I think she is the smartest and best qualified candidate. She was a professor and top scholar in law and economics before she held elected office, and has a long history of humanitarian perspectives with a solid academic and technical background in law and economics.",
    "question":"What about her being a Republican until 1996?",
    "context_token_len":92,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":0
  },
  {
    "id":61,
    "context":"alternate_viewpoints_perspectives: I'm not sold on the math\/science semantic shift but I think it's a relatively small point anyways, feel free to disagree if you seriously believe STM and liberal arts are basically the same. The economic question has to lead moral questions. Otherwise you risk making the entire system insolvent and arguing philosophy on the road to mass poverty.",
    "question":"Or is there another reason you would like to provide as to why you are so resistant to this idea?",
    "context_token_len":68,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":6.5,
    "ExpertOpinion":1.0,
    "FearAppeal":2
  },
  {
    "id":62,
    "context":"alternate_viewpoints_perspectives: The speed limit is put in place by a governing body. This speed should be the speed that I can safely drive down a road, it's that simple. Why then is there an object, also put in place by this governing body, that would damage my vehicle if I were to drive the speed that they told me to drive? It is completely illogical. If they want people to drive 10 MPH then the speed limit should just be 10 MPH. For example, on the road in front of my house the speed limit is 35 MPH and there are 3 speed bumps spaced about every quarter mile.",
    "question":"What about curves in the road?",
    "context_token_len":121,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":63,
    "context":"alternate_viewpoints_perspectives: “But the exact same framework is used against suicide as what happened in prior decades against homosexuality - that's why the illustration is here. You are taking a current norm and saying others who don't follow such as \"sick,\" akin to homosexuality a few decades ago. I don't think this is accurate. For one thing, homosexuality would still be considered a mental illness if it actually impaired people's ability to function, it's just that evidence showed that it did not, and the only reason that it was classified as a mental illness for so long was due to political pressure.” Psychiatry has a long, long history of considering deviant behaviour mental illness – not only with homosexuality but with woman’s suffrage \/ woman’s “rights” to runaway slave syndrome. “Suicide by definition impairs a person's ability to function, but I agree that that by itself isn't enough to classify it as some kind of illness. And for the record, suicide is not classified as an illness, suicidality is considered a symptom of other conditions. “ With each DSM revision there has been monumental changes to the models of mental illness and what counts as illness to begin with. \"This is a weird statement for someone who claims to be familiar with psych research to make.",
    "question":"What about Bipolar Disorder?",
    "context_token_len":250,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":64,
    "context":"alternate_viewpoints_perspectives: Now typically drafts in the past were for young men between the ages of 18 and 25, however, this just means armchair soldiers who are of a much older generation basically send young adults to an early death. I would suggest raising the maximum age to 65 and possibly more. Is it smart to send people who are not capable of peak performance into war? No, but neither is starting wars for absolutely no reason. Then if we want to get even more technical, those who vote in favor of a party that supports war they will be at the start of the draft.",
    "question":"Or is your draft idea reserved only for military action you disagree with?",
    "context_token_len":115,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.5,
    "FearAppeal":2
  },
  {
    "id":65,
    "context":"alternate_viewpoints_perspectives: However the reason for that isn't that African Americans are an inferior, more violent race, but most likely because centuries of systematic racism meant that African Americans are now disproportionately poor and worse educated. Very true, and a problem that needs addressing, but also not something that should be a factor in a police officer's decision to use their gun or not.",
    "question":"How about police try to stop killing people in the first place?",
    "context_token_len":72,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":4
  },
  {
    "id":66,
    "context":"alternate_viewpoints_perspectives: Morality is an evolutionary trait of our species. Being social animals, we evolved a sense of \"right\" and \"wrong\" that allowed us to more peacefully coexist with each other and\/or better survive in a particular environment. As such, morality is rooted in an arbitrary - and sometimes obsolete - need to survive. This, in my view, makes morality subjective. A lot of people are convinced that morality is objective, including a lot of philosophers. I would like to agree with them, but I can't seem to convince myself.",
    "question":"Is there anyone who even disputes that?",
    "context_token_len":107,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":67,
    "context":"alternate_viewpoints_perspectives: Many believe Walmart is a corrupt, or cruel\/evil company. Crime runs rampant in their parking lots with little care from them.",
    "question":"What about public roads?",
    "context_token_len":28,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":68,
    "context":"alternate_viewpoints_perspectives: Veronza Bowers Jr. is a former Black Panther Party member from California who has been in jail in the USA for over 46 years for allegedly murdering a park ranger. I'll quote directly from the website run by his family and friends to explain why that's a bunch of bullshit. In 1973, Veronza was convicted in the murder of a U.S. Park Ranger on the word of two government informers, both o whom received reduced sentences for other crimes by the Federal prosecutor's office. There were no eye-witnesses and no evidence independent of these informants to link him to the crime. At his trial, Veronza offered alibi testimony which was not credited by the jury. Nor was testimony of two relatives of the informants who insisted that they were lying.",
    "question":"Do you perhaps have a different source on the information of the case?",
    "context_token_len":146,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":1.0,
    "FearAppeal":2
  },
  {
    "id":69,
    "context":"alternate_viewpoints_perspectives: (Excuse the plenty of additional qualification statements, please, I expect this to go off topic fast and hard in multiple directions even with them. For anyone not sick of this topic yet...) I'm so tired of the refrains on both sides of this. Fair warning, I'm going to ignore anyone that says something like \"The memo is misogynistic!\" or \"Liberals just care about feels over facts!\" because I've spent too much energy already arguing on things that are just people retreating into their comfortable ideological niche. And I've seen too many otherwise smart and caring people make this firestorm worse by jumping in unprepared. I don't care about any of that right now.",
    "question":"And what was that something else?",
    "context_token_len":137,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":0
  },
  {
    "id":70,
    "context":"alternate_viewpoints_perspectives: If you believe that it is lawful, and give a set a of reasons to explain why it is lawful, then those same reasons can be used to explain why it is lawful to kill any human being. This is terrible logic. Unless you specify what those reasons are, it's completely unfounded to assume they would apply to all human beings.",
    "question":"What other reasons do you have?",
    "context_token_len":70,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":2.0,
    "ExpertOpinion":1.0,
    "FearAppeal":2
  },
  {
    "id":71,
    "context":"alternate_viewpoints_perspectives: Something you inflict upon yourself is not a punishment. You're not inflicting it upon yourself if you drive and get into a car accident despite taking every precaution not to.",
    "question":"Who else inflicted it upon you?",
    "context_token_len":35,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":72,
    "context":"alternate_viewpoints_perspectives: Many of the attendees at the Unite the Right rally were most definitely neo-Nazis and white nationalists. However, there's reason to believe that a good number was there to protest what was, in their eyes, direct dishonor to their veteran ancestors.",
    "question":"Was there any other rally or public way for the descendants of fallen veterans to voice their protest?",
    "context_token_len":51,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":73,
    "context":"alternate_viewpoints_perspectives: DISCLAIMER: In this post, when I say \"skilled worker\", I'm referring to university educated population such as researchers, engineers, doctors etc. I am well aware that trade school workers can be just as intelligent and skilled as their university counterparts but for the sake of this thread, I'm not including trade schools. I've been seeing a troubling trend recently. Immigration is becoming increasingly more expensive and difficult.",
    "question":"Have you considered that instead of shilling for infinite immigrants you should advocate for less government regulation?",
    "context_token_len":84,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":4.5,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":74,
    "context":"alternate_viewpoints_perspectives: First off, I am not saying your biological sex defines you. I understand that some biological men don't feel like they are a man and some biological women don't feel like they are a woman. That, I have no problem with. However, the definition of gender is \"the state of being male or female (typically used with reference to social and cultural differences rather than biological ones).\". There are obviously social and cultural differences between identifying as a man or woman, so it makes sense that people should be able to identify as whichever. However, there really is no defined social and cultural difference between being a Male and an \"astral gender\" for example.",
    "question":"What about cultures where there are definite social and cultural gender categories that are neither male nor female?",
    "context_token_len":136,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":75,
    "context":"alternate_viewpoints_perspectives: Words don't work on them, what else do we do? We let them keep organizing and gaining numbers? We let them think what they say has no consequences? Non-violence =\/= non-consequence. If the only consequence you can think of includes violence, youre not in a position to lead.",
    "question":"What are these other consequences mate?",
    "context_token_len":64,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":76,
    "context":"alternate_viewpoints_perspectives: Islam is a religion of peace. Islam has existed since the 7th century and since has gained an awful reputation in the west because of its brutal conquests from Pakistan all the way to Spain. It has been characterized in many different ways (sexist, violent, bigoted) and has been frowned upon by many people in the west. The truth is that Islam isn't pacifist but neither is it a warlike cult based off of Christianity and it's goal to kill or assimilate the world into one Muslim mass. I have seen many people criticize Islam in a hateful way without truelly understanding it and never has anyone presented to me an argument that would convince me that Islam is a death cult.",
    "question":"Would you say there is an vast number of other options between death cult and peaceful religion?",
    "context_token_len":135,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":3.0,
    "FearAppeal":5
  },
  {
    "id":77,
    "context":"alternate_viewpoints_perspectives: My view is that there is not enough evidence to make a call one way or the other. How is a billion data points not enough evidence? You trying to convince me that there is even more uncertainty in the science does not change my view. No, my argument is that you are not applying the same uncertainty to not getting vaccinated.",
    "question":"Or is it just possible that there is equal risk?",
    "context_token_len":69,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":78,
    "context":"alternate_viewpoints_perspectives: The purpose of my post was to say that people who make intelligent AI with good intentions (as said in the OP) are not doing anything immoral. Obviously there can be people who are bad cookies and they don't fit into my argument. That being said there are people who have kids that they raised to be Mass murderers. Also there is a huge difference between downloading and uploading information to the internet. You could have an AI download infinite amount of information without uploading anything about the AI.",
    "question":"But an AI system that is based in code?",
    "context_token_len":99,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":79,
    "context":"alternate_viewpoints_perspectives: My boyfriend really likes Slipknot so I've been listening to it a lot recently. I think they are bad, all their songs sound similar, and they cater to an immature audience. It's the kind of music I would have listened to in 7th grade when I was feeling rebellious. I think if you are an adult listening to it then you probably are immature. I don't think it's quality music, I think the screaming and horror-esque nature of their music is a shtick that is way over played. I don't think any mature balanced adult would listen and enjoy their music. Edit: I don't usually judge people on their music taste, I was in an aggravated state when I posted this.",
    "question":"What more can you ask in a band?",
    "context_token_len":143,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":80,
    "context":"alternate_viewpoints_perspectives: It has recently come to my attention that in almost every US state, felons in prison are not allowed to vote. Beyond that even, some felons are not allowed to vote after they've served their sentence, and are 'rehabilitated'.",
    "question":"What about repeat offenders?",
    "context_token_len":49,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":81,
    "context":"alternate_viewpoints_perspectives: Why would they? Most people hand leadership roles to people much like themselves. It's mainly the consumers who decide the markets, so eventually darwinism will work its magic. Is the situation right now not impactful enough to account for even \"10% of patriarchy\"? ...no? There's plenty of women in leadership roles nowadays.",
    "question":"How about other roles in society?",
    "context_token_len":67,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":82,
    "context":"alternate_viewpoints_perspectives: Being black doesn't cause single parenthood. Being black doesn't cause criminality. Single parenthood causes an increase in the likelihood of criminality. Being black is correlated with single parenthood, with something like 70% of black kids being raised by single parents. This causes a high level of criminality within the black community. A black kid with two parents doesn't suffer from this lack of privilege.",
    "question":"But might there be another privilege that the black child does not possess simply by not being white?",
    "context_token_len":77,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":83,
    "context":"alternate_viewpoints_perspectives: If you care about the rule of law you cannot justify an arbitrary elimination of the right to trial by combat by simple royal decree. That's not respect for the rule of law, that's just dictatorship. And the laws of men or gods never said homosexuality should be punished let alone punished by rape. And the law doesnt say 'forgive those who convert the king to your cause'.",
    "question":"How else are you suppose to change laws in a monarchy?",
    "context_token_len":81,
    "is_Critical":false,
    "CauseToEffect":4.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":84,
    "context":"alternate_viewpoints_perspectives: Now that the Biden-Harris Administration is in power, we are at a historic moment when it comes to ensuring the safety of the American people. WE NEED TO CONFISCATE ALL FIREARMS AND DESTROY THEM.",
    "question":"Have you perhaps considered that an easier solution is banning or limiting the sale of ammunition to private people?",
    "context_token_len":41,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":4.0,
    "ExpertOpinion":0.0,
    "FearAppeal":4
  },
  {
    "id":85,
    "context":"alternate_viewpoints_perspectives: 2. There are any number of reasons somebody couldn’t move out of the District. It continues to be completely unfair to disenfranchise these people. 3. Yes. Make it MUCH smaller 5. That’s what they said about (insert half the amendments here)",
    "question":"What other amendment faced this much resistance from the entire country?",
    "context_token_len":53,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":86,
    "context":"alternate_viewpoints_perspectives: Ok, so admitted I'm a bit biased here. But come on now. It should be understood as standard etiquette to unatturally suppress all sounds while using an otherwise silent public bathroom.",
    "question":"What about people who talk on their cell phones in public bathrooms?",
    "context_token_len":38,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":87,
    "context":"alternate_viewpoints_perspectives: It pretty much does since all those other issues are so tied to economics. If you don't care about poverty then you're not progressive.",
    "question":"Or that poverty is the only truly progressive issue?",
    "context_token_len":30,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":88,
    "context":"alternate_viewpoints_perspectives: This is an opinion I've had for a while and have tried to discuss with pro-outdoor cat people. I like to think most topics are nuanced (hence why I'm posting it here), but I really have a hard time seeing any nuance with this one. Here is my reasoning, and I'll try to outline what arguments I've heard that do not and probably won't convince me of anything: 1. Cats a domesticated species. I hear people say they're \"half-wild\", \"less domesticated\", etc - but the type of cat that we as humans keep as a pet is literally a unique domesticated species. They depend on us for food, shelter, and healthcare. Ferals obviously exist, but their quality of life is poor comparatively.",
    "question":"But what about parts of the world where feral cats live?",
    "context_token_len":155,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":89,
    "context":"alternate_viewpoints_perspectives: I’m saying that racism is bad and people shouldn’t be treated differently based on their race regardless of the past. Divisiveness does not solve divisiveness. If the goal is equality, then drop race completely. Every person is held to the same standard regardless of race.",
    "question":"What about recent White immigrants?",
    "context_token_len":54,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":90,
    "context":"alternate_viewpoints_perspectives: Nope, not remotely the point I was trying to make. The point that I was making was not related to the original prompt.",
    "question":"But what would be the other solution?",
    "context_token_len":28,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":2.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":91,
    "context":"alternate_viewpoints_perspectives: Service animals are (so far) the only thing I can sort of accept as a less evil answer to this. I understand it (heart problems and autism run in my family), but I flat out don't like it. Dogs are living beings, not some sort of object to make our lives easier.",
    "question":"What about sled dogs?",
    "context_token_len":64,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":92,
    "context":"alternate_viewpoints_perspectives: While it is fair to focus on deaths, it is lackluster to neglect the fact that mass shootings affect far more people than any single murder. In a public space with a sudden mass shooting, you suddenly have +20 (as a conservative estimate) running for their lives. In tight packed places this goes up rapidly. People are running in fear of death.",
    "question":"What about the black people who have to constantly worry about violence from the police?",
    "context_token_len":72,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":93,
    "context":"alternate_viewpoints_perspectives: Right, but my argument is that lounges, first class, etc. are not actually luxury services, it’s just what everyone should receive for their ticket prices. However, airlines want to make the experience “below” what it should be so that people upgrade. Other businesses have reasonable services and only make people upgrade for actual luxuries.",
    "question":"Do you know of any other business in the entire world that could afford to just increase expenses by 5x and remain profitable?",
    "context_token_len":68,
    "is_Critical":false,
    "CauseToEffect":4.0,
    "Analogy":3.5,
    "ExpertOpinion":4.0,
    "FearAppeal":3
  },
  {
    "id":94,
    "context":"alternate_viewpoints_perspectives: Thank you for sharing your story. As an atheist, I agree that Islam is a false religion. I would also not like to live in a nation based on Sharia law.",
    "question":"Or that support for Sharia is overwhelmingly high?",
    "context_token_len":37,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":95,
    "context":"alternate_viewpoints_perspectives: Their is a massive political divide right now, at this current time even being civil friends with a member of the opposite political party can be seen as extreme. Now as much as they would deny it, politicians want this.",
    "question":"Have you considered the role the media plays in this?",
    "context_token_len":46,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":4.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":96,
    "context":"alternate_viewpoints_perspectives: I went from crappy phone I had for three years, keys falling apart, spotty cricKet cell service to an iPhone 5 when I was able to pay for my own phone bill in college. Let's just say I fell in love and now have an iPhone 6. It's super easy to use, a lot of people have iPhones, the camera quality is spectacular. I have no complaints except the iPhone 7 would eventually be my next, but I hate that the iPhone 7 doesn't have an aux. I love iPhones but maybe I need to view what other options there are.",
    "question":"Do you want lots of options for third party accessories?",
    "context_token_len":116,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":97,
    "context":"alternate_viewpoints_perspectives: Autonomy is always an issue. Can you be forced to give blood to save a human life? Can you be forced to donate a kidney to save a human life? Can you be forced to donate bone marrow to save a human life? In all of these cases, the answer is no. You have the right to allow someone else to die, in order to maintain your bodily autonomy.",
    "question":"What about the right to kill?",
    "context_token_len":79,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":98,
    "context":"alternate_viewpoints_perspectives: I was riding around in the car with some friends today thinking about songs. I think they all can be classified into a ballad or an anthem. I don't know if this has been thought of previously, undoubtedly I think yes. I can't find anything online about it, and having listened to a couple of hours of music today (quite the variety too), it was hard to find any songs that didn't exactly fit in one of those descriptions. Ballad - A kind of narrative poem, adapted for recitation or singing especially, a sentimental or romantic poem in short stanzas. Anthem - A choral or vocal composition, often with a religious or political lyric. Usually upbeat, celebratory. I'd also might like to know what anyone else thinks about this, and if there is a category of type of song I am missing.",
    "question":"What about music with intentionally meaningless lyrics?",
    "context_token_len":166,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":99,
    "context":"alternate_viewpoints_perspectives: But what about jobs where you individually negotiate salaries or where one member of staff had more experience (but same qualifications). This is gonna end up resulting in different pay among staff, and openly sharing that is just gonna cause a shit storm. “Why is X being paid more, that’s so unfair? ?” Nothing unfair about it, X has more experience and negotiated.",
    "question":"But maybe negotiation skills are overvalued here?",
    "context_token_len":79,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":100,
    "context":"alternate_viewpoints_perspectives: The issue is that experiential generalizations are virtually unfalsifiable by design in a debate context. It's not like we can provide you with experiences.",
    "question":"And who else besides you in this thread is trying to do that?",
    "context_token_len":29,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":101,
    "context":"alternate_viewpoints_perspectives: I think it is important to separate the notion of requiring education from the actual administration of schools by government. Milton Friedman acknowledged the benefits of a mandatory minimum amount of general education of citizenry but extolled the virtues of \"school choice.\" I don't think it is necessarily the case that taxing citizens to pay for general education leads to a lack of market forces. Some implementations of \"school choice\" still tax citizens. Forcing children to do things that benefit them and\/or society in the long run is part of, if not the essence of, parenting.",
    "question":"How about forcing their parents?",
    "context_token_len":110,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":2.0,
    "ExpertOpinion":2.0,
    "FearAppeal":4
  },
  {
    "id":102,
    "context":"alternate_viewpoints_perspectives: According to Article II of the U.S. Constitution, the president must be a natural-born citizen of the United States, be at least 35 years old, and have been a resident of the United States for 14 years. There is no measurement on how well they understand the government they want to represent.",
    "question":"How about the people who vote?",
    "context_token_len":61,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":103,
    "context":"alternate_viewpoints_perspectives: I see no point in responding to this. I'd be happy to debate with you once you provide a civil response, otherwise I'm not interested.",
    "question":"Or, is it just something a harpy invented for the sake of arguing?",
    "context_token_len":32,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":2.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":104,
    "context":"alternate_viewpoints_perspectives: It's really not. Almost all CEOs are over 6ft, professional athletes are disproportionately tall. Tall people are more successful than short people, generally. Should we worry about Tall supremacy? I can say that I agree with why the Black Panthers and BLM started.",
    "question":"Or do you think that BLM is justified because of muh oppression?",
    "context_token_len":54,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":105,
    "context":"alternate_viewpoints_perspectives: I disagree that children really get the final say with religion. I think the insane correlation between your religion and where you were born basically shows that. Also you can't really force science on someone, its based on evidence.",
    "question":"How about you prove what gravity is then?",
    "context_token_len":46,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":106,
    "context":"alternate_viewpoints_perspectives: Was he? As far as I can tell that's just an assumption. He released no statements about his homophobia. His statements to his father earlier in the week expressing disguise at a gay couple kissing, only makes mention of him being mad they are doing where his 3 year old son can see, not Islam. And yes other homophobes have committed mass murder like stonewall.",
    "question":"Did other homophobes scout out Disney World as a potential target for mass murder?",
    "context_token_len":75,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":6.0,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":107,
    "context":"alternate_viewpoints_perspectives: There's likely no way to know who passed the virus on to who once it becomes common in the population. It isn't yet, though. A 90 year old lady dying would be really sad. But why isn't that argument used with the flu? Well, in civilized countries we do actually. If you're sick with the flu, you stay at home, also because otherwise the economic damage to the rest of your company is higher than whatever pay you will get without doing work. But you're also ignoring the human aspect of it.",
    "question":"What about the human element of homelessness?",
    "context_token_len":110,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":108,
    "context":"alternate_viewpoints_perspectives: Thanks for your well thought out response. Can you expand on what a “minority report society” is? I’ve never heard that.",
    "question":"But was any of this in any news paper?",
    "context_token_len":29,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":109,
    "context":"alternate_viewpoints_perspectives: You would not say \"Jews are bad people, I met some that proved they aren't but I just assume they are bad until they prove otherwise on rare occasions\". (which is literally the words you used) You also wouldn't say that about Muslims. It's just clear bigotry. You say it about Republicans, because it's less obvious bigotry and you might not get called on it, but it doesn't make it less of a bigoted idea.",
    "question":"What about this do you not agree with?",
    "context_token_len":93,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.5,
    "FearAppeal":2
  },
  {
    "id":110,
    "context":"alternate_viewpoints_perspectives: I agree that the degree of power given by that notebook is rather corrupting, but that's now what the CMV is about. For those who somehow don't know what Death Note is, it's an anime\/manga focusing on a magical notebook where you write down a person's name while thinking of their face and that person dies after a while, defaulting to a heart attack after 40 seconds unless you write down the date and the method of death. Japan has a low crime rate and most of the few criminals are properly punished, so Yagami's doings seem harsh. In my country, however, the crime rate is high and there is an extremely high rate of impunity, especially among the rich and powerful. Hell, there was a fucking serial killer on the loose until recently when he was killed. It's hard to see Yagami's killings as harsh. I agree that the easy path of killing is not the best one, but the constant impunity gives a feeling of hopelessness.",
    "question":"What about good people who are stopping you from killing murderers?",
    "context_token_len":195,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":4
  },
  {
    "id":111,
    "context":"alternate_viewpoints_perspectives: This post isnt meant to downplay the atrocities of the Holocaust, so dont misinterpret Climate change is not a political position, if you think it is you're dillusional. The billions of people who will be greatly affected by climate change is unreal and lets also consider the generations after.",
    "question":"What about the climate people makes them worse?",
    "context_token_len":58,
    "is_Critical":true,
    "CauseToEffect":3.5,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":7
  },
  {
    "id":112,
    "context":"alternate_viewpoints_perspectives: He said a federal judge shouldn’t rule on the Trump University fraud case because the judge was a “Mexican” and therefore wouldn’t treat him fairly. Republican leaders called this out as textbook racism. How is that not racist? My personal Trump racism top 10, in case you’re not already familiar with any of these: 1. Birtherism (Obama and Harris) 2. Judge Curiel can’t judge Trump because he is a Mexican. 3. Pardon of Sheriff Joe Arpaio, jailed for racist abuse of prisoners 4.",
    "question":"How about Thomas Jefferson?",
    "context_token_len":104,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":0
  },
  {
    "id":113,
    "context":"alternate_viewpoints_perspectives: This is prompted by a recent rape allegation against Trump. I was quite happy he won the election primarily because the policies and arguments put forth by Democrats around expanding entitlement spending and immigration and criminal justice seemed very dishonest and destructive. Further, ever since the high profile rape hoaxes such as the UVA incident, the Columbia mattress girl, or the Duke Lacrosse travesty, I have been very skeptical of high profile sexual assault allegations. Thus, I found the sexual assault allegations against Brett Kavanaugh to be quite flimsy. For the most recent allegation of rape against Trump, I was at first very skeptical due to the amount of time passed and her motivation of wanting publicity for her book. However, after hearing her interview, I found her account to be extremely credible and honest. Despite how bad Democrats’ policies would be, we can’t have a rapist in the white house.",
    "question":"But what about the Democrats?",
    "context_token_len":171,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":0
  },
  {
    "id":114,
    "context":"alternate_viewpoints_perspectives: Obviously it would be unfair to ban cars without improving transit infrastructure. I would obviously not support banning cars still dependent on car infrastructure. You will not change my view by telling me about how you need a car or how you’re bus commute takes ten times as long. Please focus on other problems in my thinking rather than sob stories about how the solution to car dependent urban hellsscapes is actually more cars.",
    "question":"What about trucks?",
    "context_token_len":81,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":115,
    "context":"alternate_viewpoints_perspectives: Fetus definition- unborn offspring of a mammal, in particular an unborn human baby more than eight weeks after conception. Baby is a correct term, its literally in the definition of a fetus. 3,000 or so abortions are rape victims.",
    "question":"What about those rape babies?",
    "context_token_len":46,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":116,
    "context":"alternate_viewpoints_perspectives: Cards on the table - I'm a copywriter, and I struggle with this idea sometimes. Advertising and marketing rely on agitating people's fears and worries to motivate them to take some action that benefits the company doing the marketing.",
    "question":"What about the marketing campaign to stop teen smoking?",
    "context_token_len":46,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":4
  },
  {
    "id":117,
    "context":"alternate_viewpoints_perspectives: I never understood as to why gay marriage is not legalised, I’ve tried looking up opinions as to why people are against it but all I’ve got is religious answers. I’m not religious, I’m bisexual and have a boyfriend, we’re both from religious background, converted in atheism. Based on that, is there any legitimate reason as to why two consenting adults shouldn’t be allowed marriage. The strongest argument I’ve heard if if you legalise gay marriage, then you’ll have people tell religious institutions that you have to host gay marriages, but my counter argument would be how is that any different to saying that you shouldn’t tell churches that they have to host black people’s wedding. As far as I’m concerned I didn’t choose to be bisexual, I was born this way and will always have these feelings, just as people are both black and that’s part of their identity. Even if you’re pro gay marriage I urge you to take a shot, see if you can come up with any anti gay marriage arguments, it’s called CMV after all!",
    "question":"Who else will the marriages be legalised for?",
    "context_token_len":214,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":118,
    "context":"alternate_viewpoints_perspectives: What if it's a baseball bat once a month? A stabbing once a month? The frequency of an action should not be a factor of what is mistreatment. you're focussing on the frequency, when I clearly state \"a spanking\".",
    "question":"How about 8 spankings a day?",
    "context_token_len":50,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":119,
    "context":"alternate_viewpoints_perspectives: They're so vulnerable to get hit, they're so slow, and they wanna take up a whole lane when there's a empty sidewalk like 10 feet away! Bikes have no mirrors and just have a little red reflector on the back. Bicycle lanes just share the road with cars. No, that's silly. They should share a lane with the sidewalk, away from cars. Is there any benefit to them being on the road? Anytime I see someone riding a bike, it'll be on the sidewalks, but the hardcore Lance Armstrong wannabees take up a whole lane that endanger everyone else.",
    "question":"Or the cyclist takes a risk where the worst case scenario is injury or death to him AND a pedestrian?",
    "context_token_len":119,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":5
  },
  {
    "id":120,
    "context":"alternate_viewpoints_perspectives: The point being if a drug can lead to an increased potential of someone causing harm to another (or themselves) that is the reason it’s prohibited to begin with. Because things affect more people than just the person using drugs. To be fair, being illegal doesn’t stop the drug from being abused. It just paints the picture that it’s something we as a society openly condemn as unacceptable behavior because of the potential consequences. Again self centered point of view, “ I know you shouldn’t kill someone” so it’s not ok for me to kill someone else when on drugs but it’s ok for me to kill myself on them because….that action doesn’t affect anyone else? I get where you’re going with it, but truth is not everyone can be responsible for their own actions. Some people need guidelines like “hey some drugs are bad try to avoid them or else”",
    "question":"What about alcohol?",
    "context_token_len":175,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":121,
    "context":"alternate_viewpoints_perspectives: I think something that is missing from this train of thought is historical precedent. While current political situations might be the cause of the extremism, a integral part of Islamic history is the expansion of the caliphate in the Middle Ages. This history, along with the concept of jihad, are somewhat unique to Islam.",
    "question":"How about the Jewish traditions and beliefs about conquering Canaan for a new nation?",
    "context_token_len":62,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":122,
    "context":"alternate_viewpoints_perspectives: I don't think so. Either the administration recognizes that it is preventing good teachers from doing their job and remedies the issue (by untying her hands) or the administration replaces her with a substitute that will probably make the situation worse. I think both of these outcomes are significantly better than the teacher burning herself out running damage control. Either the school adapts or it eventually breaks down, and hopefully by then the good teachers will be long gone from it. It's when the good teachers don't abandon shitty schools that there is a problem, because in the process of removing unworkable schools you end up removing good teachers too.",
    "question":"What about the students who are supposed to be educated by these shitty schools?",
    "context_token_len":124,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":123,
    "context":"alternate_viewpoints_perspectives: So basically your view boils down to, \"The amount of welfare for single mothers should be increased\"? Or, are you arguing that it should be increased if and only if the father expressly states that he wants a financial abortion? This would create a financial incentive for a father to opt for financial abortion, even if he actually wants the child.",
    "question":"What other alternative would there be to pay for the child?",
    "context_token_len":71,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":124,
    "context":"alternate_viewpoints_perspectives: I disapprove of this possibility. Don't get me wrong I fucking hated school, hell I didn't even finish high school. But it moulded me into the person I am today through the social interactions I had, through the disagreements I had. How the hell are you supposed to know how to act if most if your social interactions are through a god damn screen.",
    "question":"And the point about learning how to act in the real world?",
    "context_token_len":74,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":125,
    "context":"alternate_viewpoints_perspectives: It is very important where the money comes from, because that is the factor which makes this a question of morality and character. If the person risked their livelihood on a lucky investment, and now they are making more money in interest on that investment than they are spending each day, then there is nothing wrong with them laying around doing nothing and waking up richer than they went to sleep. If the person is getting paychecks from the government, then it all depends on where in the government that money is coming from. If they worked their whole life and paid taxes, and now they are getting social security checks while living with their successful children, there is nothing wrong with that. If someone is laying around collecting government checks without ever having done any work, then it is wrong.",
    "question":"Or is is wrong that someone earns more money doing nothing than someone who works 8 hours a day?",
    "context_token_len":155,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":126,
    "context":"alternate_viewpoints_perspectives: Not saying one way is better than the other. My point is blaming a problem on an entity not in practice is not accurate.",
    "question":"Is anyone blaming free market capitalism though?",
    "context_token_len":28,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":4.0,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":127,
    "context":"alternate_viewpoints_perspectives: I understand your point of view and I completely agree. It is exhausting at times to keep watching serious shows and consuming real life issues as we sometimes need a feel good show. But what am saying is being historical in accurate when casting your actors without taking in consideration the social context does more haram than good. Imagine how funny it would be to see a fiction about romance inside North Korea and the elite class is from African or European ancestry. Things like these are very important to consider when making a fictitious set in a historical period.",
    "question":"Have you considered that maybe other things that you think are inaccuracies also are more historically accurate than you thought?",
    "context_token_len":107,
    "is_Critical":false,
    "CauseToEffect":4.0,
    "Analogy":4.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":128,
    "context":"alternate_viewpoints_perspectives: In the words of Eddard Stark “The man who passes the sentence should swing the sword. If you would take a dog's life, you owe it to him to look into his eyes. And if you cannot bear to do that, then perhaps the dog does not deserve to die.” Taking a dog to a vet to have it injected with poison is a pussy's way out. To put the final burden of animal ownership onto another person. It is an abandonment of responsibility. If a person is not willing to do this, then he should not get a dog.",
    "question":"What about animal cruelty laws?",
    "context_token_len":117,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":129,
    "context":"alternate_viewpoints_perspectives: I see a lot of drivers making stupid mistakes on the roads and a lot of drivers driving with unnessecary distractions like food or cellphones. Drivers have a lot of responsibility driving on roads with thousands of other people and in an instant could take a life with a dumb mistake. This all could be cut down if people's driving skills stay sharp with regular check ups.",
    "question":"How about getting onto and off of the interstate?",
    "context_token_len":73,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":130,
    "context":"alternate_viewpoints_perspectives: But they are not the same just because you think they are the same. This is misconception that leads to confusion like this post.",
    "question":"Or would you make a new term to help explain it better?",
    "context_token_len":28,
    "is_Critical":false,
    "CauseToEffect":6.0,
    "Analogy":2.5,
    "ExpertOpinion":6.0,
    "FearAppeal":4
  },
  {
    "id":131,
    "context":"alternate_viewpoints_perspectives: To clairfy, I'm defining animal rights activism as any sort of activism that tries to limit human freedom for the sake of animal well-being (of individual animals, not trying to prevent species extinction which is a valid concern, since that could have wide-spanning ecosystem effects). Wildlife rehabbers, environmentalists trying to stop the extinction of species, etc would still be allowed. I don't really see any advantages for humanity for allowing this sort of stuff in a society.",
    "question":"Do you also object to laws against bestiality?",
    "context_token_len":95,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":132,
    "context":"alternate_viewpoints_perspectives: I just want to start off by saying that I'm openly transgender, however feel excluded from the Transgender community at large because I prefer to take a nuanced opinion. I believe that the right way forward for the transgender community to gain acceptance is via the medicalization model and for gender dysphoria to be viewed and treated as a medical condition, with transitioning as a viable treatment to improve their lives. I believe that gender dysphoria is similar to a mental illness such as depression, influenced by both biological (with the effect of embryonic effects of hormones on brain structure), but people call it a mental illness with the goal of depriving transgender people from treatment while I wish for transgender people to gain acceptance and receive treatment.",
    "question":"So what about dysphoria?",
    "context_token_len":140,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":0
  },
  {
    "id":133,
    "context":"alternate_viewpoints_perspectives: It’s just the way things are and none of us can change them. Women and men both have their respective privileges, and the problem here is women want to have men’s privileges while retaining their own.",
    "question":"What other privileges do women have?",
    "context_token_len":43,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":134,
    "context":"alternate_viewpoints_perspectives: Since you're interested in arguments and not loaded language perhaps you can share what your definition of life is? You argue that it shouldn't be called something \"loaded\" while at the same time do not present an alternative argument for the definition of life for us to scrutinize. If the fetus is a human life it \\ is\\ homicide. If it's not a life it might be called \"termination\". Why is it not a life? Stake out some intellectual territory please.",
    "question":"Or something more akin to what we think of as personhood?",
    "context_token_len":96,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":5.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":135,
    "context":"alternate_viewpoints_perspectives: First, let me state I am a progressive and very pro BLM. The bar for conviction of criminal charges is set extremely high in the United States. After the charges for minor weapon possession were dropped on a technicality regarding barrel length, there was nothing left to convict on. It can be very easily assumed by any member of the jury that Rittenhouse acted in self-defense. He will go free on all charges remaining, and he should. We must preserve the right to self-defense including using deadly force, if necessary.",
    "question":"What about taking a gun across state lines?",
    "context_token_len":106,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":136,
    "context":"alternate_viewpoints_perspectives: Sure it’s a lot of fun and a pleasant surprise when you eat out with your family, and your sibling or parent says “hey, would you like my sea salt pickle?” And you’d like “oh, sure! Thanks!” because you love pickles. But that can only happen with family or a select few friends you don’t mind eating after. But with germs (and now, with COVID added), no one wants to eat others’ food. So many people order a sandwich (like from Firehouse Subs) and just throw the complimentary pickle away. It is disappointing to pickle lovers like me.",
    "question":"What about when the free pickle makes your buns soggy?",
    "context_token_len":125,
    "is_Critical":false,
    "CauseToEffect":5.5,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":4
  },
  {
    "id":137,
    "context":"alternate_viewpoints_perspectives: all you'll have are the folks with big enough war chests and the resources to plow through the process. Because it isn't that way already? If they built their fortunes in a legitimate way i have no problem with them running for office.",
    "question":"What about Joe Middle Class who wants to run for city council or the state legislature?",
    "context_token_len":50,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":138,
    "context":"alternate_viewpoints_perspectives: Aging is responsible for roughly 90% of human deaths today. It has killed over 100 billion human beings since the dawn of homo sapiens. It is the primary risk factor for the 'big 4' chronic diseases that kill most people today - cancer, heart disease, diabetes and Alzheimer's disease. You might think lifestyle (diet, exercise) are important risk factors but over time, aging becomes a 10x to 100x greater risk factor for these diseases than any lifestyle factor. Hence, governments should reduce spending towards defense, finance, even climate action and poverty and invest in aging research instead.",
    "question":"Or is the plan to spend it on education to get more people up to speed?",
    "context_token_len":117,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":139,
    "context":"alternate_viewpoints_perspectives: He claims to be omnipresent and omnipotent , which in turn means he is all-powerful. And if he is all-powerful then he must also be all-knowing. And since he is all-knowing then the answer to your question is yes.",
    "question":"Could there not be a God omnipresent yet moving along time?",
    "context_token_len":52,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":140,
    "context":"alternate_viewpoints_perspectives: The modern view seems more incorrect to me. If the Roman Empire hadn't collapse we may have had a man on the moon 1000 years ago. It's not simply a lack of records, it's a lack of understanding and knowledge that goes hand in hand with bad record keeping. Of course there were advancements during this period, but what was lost far outweighed anything that was developed.",
    "question":"What was lost though other than a central power structure?",
    "context_token_len":78,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":141,
    "context":"alternate_viewpoints_perspectives: Fair enough. I do not make the claim in bad faith. My wish to avoid the rabbit hole is because it can turn into a ping-pong of studies. If you want to pick a side on whether or not eggs or milk are healthy for example, I'm sure I'll be able to find studies showing the opposite.",
    "question":"What about eggs and dairy?",
    "context_token_len":68,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":142,
    "context":"alternate_viewpoints_perspectives: I think the issue most people have with his decision is not playing for GS. It's that he left the only team in the West that showed that it was close to capable of beating them. KD and the Thunder were up 3-1 in the WCF against the Warriors in 2016. They were one game away from being back in the finals where they very well could have defeated Cleveland. His team should have won in the WCF, and when they didn't KD left for the team that beat him.",
    "question":"What team could KD have gone to that had never beaten him?",
    "context_token_len":102,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":143,
    "context":"alternate_viewpoints_perspectives: And you notice most people aren't too happy when they hear their virgin kids had sex without a condom. That's a risk selection thing. The idea isn't that people aren't being physically safe as adults, either, but that they are not taking the time to make sure that they are with a person with whom sex would be a good idea. And yes, this depends on sex having some non-zero amount of intrinsic importance.",
    "question":"Would you say the same about other activities?",
    "context_token_len":89,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.5,
    "ExpertOpinion":3.0,
    "FearAppeal":2
  },
  {
    "id":144,
    "context":"alternate_viewpoints_perspectives: Recently, Trump repealed protections for transgender students put in place by the Obama administration, leaving the matter in the hands of the states. Leaving this issue in the hands of the states just doesn't make sense to me. I assert that the rights of trans students, the rights of any student, any person, don't change at the state level. Why is Texas so unique that it must have its own specific treatment of trans students? All this action is doing is allowing backward-thinking states, with a loud conservative majority, to deny rights to trans students. It is a classic example of majority rule overpowering minority rights. This is a footnote from the CMV moderators.",
    "question":"And who is to judge who is actually right?",
    "context_token_len":134,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":145,
    "context":"alternate_viewpoints_perspectives: I agree that you can make moral conclusions if you assume some axioms. But those conclusions are only true if you accept the axioms, so they remain subjective.",
    "question":"Are there any objectively correct set of axioms to accept?",
    "context_token_len":33,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":146,
    "context":"alternate_viewpoints_perspectives: Finally, you should remember that many of these Muslim countries DO fear the west. And this is the problem and probably the main thrust of my view.",
    "question":"What about the US involvement in Iraq?",
    "context_token_len":32,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":147,
    "context":"alternate_viewpoints_perspectives: If they included it as income, they'd be double counting it. By not being able to take the state deduction, it already is costing them their marginal tax bracket (say 35 cents per dollar of state tax credit) with the feds. (Now, granted they also get a deduction for charitable contribution so it breaks even) Your source is wrong, they aren't getting back more than they paid (they're ignoring the nuance I'm explaining here), they're just breaking even in the states that give the 100% credit. Example Time: Original Taxable Income (so after all deductions\/exemptions\/etc): $100k I donate $500 to a private K-12 school. That reduces my state tax bill by $500 which results in a lowered itemized deduction. (Increasing my taxable income) New Taxable Income: $10,500 Then I update my itemized deduction to account for the charitable contribution of $500 Final Taxable Income: $100,000 So, in the end, I have the same $100,000 in taxable income, all I got was a free income deduction. Now, this all goes sideways when we take into account things like the AMT, and phasing out of deductions.",
    "question":"But what about fully refundable tax credits?",
    "context_token_len":233,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":148,
    "context":"alternate_viewpoints_perspectives: How come you don't just spell nigga and nigger instead of acting like the words have some magic to them like voldemort or something? There's obviously nothing wrong with anyone using any word but you have to accept the consequences. For example, this post of mine is likely going to get deleted because of the word choice I use. If you go around calling people nigga you're going to offend some people so why even bother using it? There's plenty of better words to call your friends than nigga. Also, I disagree that there isn't a non-racist way to say nigger.",
    "question":"Where is the racial connection other than the origin of the word that has already been modified to differ from the original?",
    "context_token_len":118,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":5.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":149,
    "context":"alternate_viewpoints_perspectives: Just finished reading the book “Why Does He Do That.” It’s a book about why males abuse women. It’s basically because they believe they are entitled to control women because they believe they’re inherently superior and should get special privileges for being a man. Trans women, as a group, behave like abusive men. They believe they’re entitled to be the centre of attention, that Cis Women should cater to them and serve them, and when we don’t, they abuse us.",
    "question":"Or threatening to rape and murder cis women?",
    "context_token_len":99,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":150,
    "context":"alternate_viewpoints_perspectives: but that they are afforded less opportunity to show how funny they are thanks to the Belushis of the world directly undermining them (and, less directly, people like you who uncritically take for granted the myth of unfunny women, thus are less likely to take a chance on up and coming comediennes by attending their shows). I disagree with that idea, because I think that other forces are at work creating the outcome we see in the comedy industry.",
    "question":"What about minority comedians?",
    "context_token_len":89,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":151,
    "context":"alternate_viewpoints_perspectives: How can someone have a successful sex life after losing it at 21. Well I lost my virginity at 22 and I have sex like 5 times a week and it's amazing. Maybe that's not a successful sex life to you, but I'm more than satisfied, even if I am a failure in your eyes. Isn't 18 an awfully arbitrary number? If you have sex the day before your 18th birthday you're fine, but a day after you're doomed? You honestly should look into therapy, would do far more for you than seeing a prostitute.",
    "question":"Is losing your virginity to a prostitute anything other than an attempt to resolve emotional issues?",
    "context_token_len":113,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":152,
    "context":"alternate_viewpoints_perspectives: You’re trying to argue that the potential for a dog to be unpredictable and potentially cause harm to a human family is not enough to justify the breeding of dogs. Interesting, do you have a study that shows mixed breeds being more dangerous (hospital injury treatments) than the pure breed population? You argued an obvious straw man because I never defended getting dangerous dogs. I’m sorry, but we’ve always chosen what we want these animals to do for us (that’s the only reason they even exist), and breeding is how we do that.",
    "question":"What about selectively breeding vegetables?",
    "context_token_len":110,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":153,
    "context":"alternate_viewpoints_perspectives: But what do IP owners get from removing old games from online stores? They can charge money to renew the license. This is especially relevant in the era of games as a service, microtransactions and so on.",
    "question":"But what about games without microtransactions?",
    "context_token_len":43,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":154,
    "context":"alternate_viewpoints_perspectives: Do you have specific instances you're referring to, or just in general? Because I wholeheartedly agree that significant changes need to be made to the structure of how individual police precincts are run. Police unions in particular are some of the culprits in not allowing jurisdictions to hold bad cops accountable to the bad things they do. This has nothing to do with whether these are good people, though. There are good reasons that these policies were put in place, I'm sure...but recent events in particular have definitely highlighted how some cops are taking advantage and abusing these policies.",
    "question":"What good reason is there for this other than allowing cops to get away with BS?",
    "context_token_len":113,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":4.0,
    "FearAppeal":2
  },
  {
    "id":155,
    "context":"alternate_viewpoints_perspectives: How would you make this work in cities with housing shortages, like SF or NY, where there are more residents than houses? This part is pretty easy: We eat the NIMBYs.",
    "question":"How about we eat the government?",
    "context_token_len":38,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":156,
    "context":"alternate_viewpoints_perspectives: A pure \"meritocracy\" will preserve existing disparities that were deliberately created for racist reasons. Looking only at a prospective student's resume is not going to give you the most intelligent, skilled, and capable people. It's going to give you the currently most accomplished people, which is a different thing. There is a STRONG correlation between both parents' education level and parents' income level and a child's educational success. Parents who are educated tend to stress education for their children.",
    "question":"And what about white and Asian kids whose parents are poor and do not stress education?",
    "context_token_len":96,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":157,
    "context":"alternate_viewpoints_perspectives: Because it more expensive to make it here than it is in Canada. We can't make all the stuff ourselves, so we buy it from Canada. Well, now that got more expensive. But now Can. metal is still cheaper than for what we can make it domestically.",
    "question":"Does anyone else make aluminum other than Canada?",
    "context_token_len":57,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":4
  },
  {
    "id":158,
    "context":"alternate_viewpoints_perspectives: Cars are one of the main contributors to air and environmental pollution in cities. First, driving through the city on a bike, going for a walk, walking your dog or just making your way to the next bus stop you inhale hazardous gases and fumes. Second, not only emissions impair our health. The noise produced by traffic on the streets also negatively effects people's well-being. Third, there are too many cars for the traffic to flow. Not only car drivers themselves waste their time in traffic, but they also contribute to buses and trams running late.",
    "question":"What about people with mobility issues who struggle with getting on and off public transport but can drive because their car has specific accommodations?",
    "context_token_len":113,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":159,
    "context":"alternate_viewpoints_perspectives: By choosing to live and work in a country that has a government, you are consenting to the terms of the social contract No. This does not follow for the mafia, so it doesn't follow for government.",
    "question":"So does it not follow for other kinds of crime than tax evasion either?",
    "context_token_len":44,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":160,
    "context":"alternate_viewpoints_perspectives: All of those things can be empirically disproved by science. Religion cannot be disproven because it makes no testable claims.",
    "question":"Or you say that all those other religions can be disproven by science but not mainstream religions?",
    "context_token_len":25,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":4.0,
    "FearAppeal":3
  },
  {
    "id":161,
    "context":"alternate_viewpoints_perspectives: Rent control interferes with free markets, and takes power of ownership away from the owner of the property. I don't rent, but if my area suddenly becomes valuable my property taxes will go up until I can't afford to live there any more.",
    "question":"What about people who already live in the cheapest area?",
    "context_token_len":51,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":1.0,
    "FearAppeal":2
  },
  {
    "id":162,
    "context":"alternate_viewpoints_perspectives: it's really not some giant mystery, although there are plenty of people in their early 20s or younger -- thousands posting daily on reddit, actually -- who are extremely racist\/sexist\/bigoted without really knowing or acknowledging it, and\/or while actively denying it. but they're willfully ignorant at best. people in the past knew that other people were bigoted pieces of shit. that's why some amount of change and progress has actually happened.",
    "question":"What about changes that would actually affect society in a serious way?",
    "context_token_len":87,
    "is_Critical":false,
    "CauseToEffect":3.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":163,
    "context":"alternate_viewpoints_perspectives: It isn't so much that men's issues are expected to fit under the umbrella of feminism, it is that it is impossible to address these issues without also addressing the feminist side of the problem. So we might as well just have both sides of the discussion at once rather than waste everyone's time attempting to address men's issues that stem from the patriarchy while pretending that women don't exist.",
    "question":"Where else do you think the idea of men being negatively affected by toxic masculinity came from?",
    "context_token_len":80,
    "is_Critical":false,
    "CauseToEffect":1.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":164,
    "context":"alternate_viewpoints_perspectives: Right now there is a debate over crime and the way to stop it. Certain groups fervently maintain that we need more police and harsher punishments. That is not going to stop crime because it does nothing to fix the cause of most crime. Most crimes are caused by circumstances and need. Making sure people have food, shelter and healthcare would go much further at stopping crime than locking people up or arresting people.",
    "question":"How about house arrest?",
    "context_token_len":82,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":1.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":165,
    "context":"alternate_viewpoints_perspectives: I’m basing this opinion off of my anecdotal experience. I travel for a living and was in 23 different countries last year...from Latin America, Europe, the Middle East, Russia, and Africa. I loved my time in each country but the more I travel the more I see that the US is by far the most accepting of non-majority people. I see a lot of discussions (Especially on Reddit) about how the US is so supremely racist particularly compared to other Western countries. However, from everything I’ve seen racism and prejudice are far more a part of these countries than the US.",
    "question":"What about Canada?",
    "context_token_len":121,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":0
  },
  {
    "id":166,
    "context":"alternate_viewpoints_perspectives: I can think of absolutely no situations where the death sentence is an ethically valid option. Criminal courts should not serve to provide satisfaction for the victims (this is the realm of civil court), and before assigning a death sentence, certain conditions must first be met: 1. The criminal must be guilty beyond any shred of doubt 2. The criminal must be mentally well (else we instead must provide mental healthcare as they can not be considered responsible for their actions) 3. The criminal must have failed in our efforts to rehabilitate them This presents a sort of catch-22.",
    "question":"What about in cases where society is literally collapsing and prisons are no longer tennable due to their extreme use of resources?",
    "context_token_len":113,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":167,
    "context":"alternate_viewpoints_perspectives: I know this is a very touchy subject for a lot of people, but I'd like to share my opinions and hear the opinions of others. Here are the reasons why I think building the wall is important in no particular order.",
    "question":"Have you thought about the environmental impacts of the wall?",
    "context_token_len":48,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":168,
    "context":"alternate_viewpoints_perspectives: You keep posting that link like it somehow proves your view. It doesn't. Biden's vote looks bad because of what has happened since then. It could have gone another way, but that's largely irrelevant because Senators don't know the future when they place a vote for or against something.",
    "question":"What about the 33 Senators who did know?",
    "context_token_len":60,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":4.0,
    "FearAppeal":2
  },
  {
    "id":169,
    "context":"alternate_viewpoints_perspectives: It kinda sounds like you’re missing the point of my examples. You’re using the retcon of the last movie (ROS) to explain things from the second movie (TLJ). That it had to spend so much time UNsubverting expectations to make things make sense is it’s biggest problem. I agree, Rey was setup to have a lineage. It was calling her a nobody that made no sense. Snoke clearly wasn’t intended to be a clone pawn, because why would a clone pawn have the ability to be so strong he could become a threat to the whole galaxy? And again this was a retcon in the last movie (which had to spend half its air time retconning things) because if he’d been killed off for no reason in TLJ it wouldn’t make sense.",
    "question":"How else would you explain Palpatine at the end of TLJ?",
    "context_token_len":155,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":4.0,
    "FearAppeal":2
  },
  {
    "id":170,
    "context":"alternate_viewpoints_perspectives: No. I am saying the objective facts of this situation - there is no null hypothesis so there is nothing that can be proven \"statistically insignificant.\" You are claiming statistical significance over something that doesnt exist, showing that you dont understand basic statistics. Considering that I have had to say this to you a dozen times, you also arent all that literate",
    "question":"Do you have any other arguments to present?",
    "context_token_len":74,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":171,
    "context":"alternate_viewpoints_perspectives: So the obvious question here is, were does the face value explanation fall short for you? Your view only makes sense if we start with the assumption that attraction to Asian women is something abnormal",
    "question":"Would there not be an equally vocal subset of white guys willing to date Arab women?",
    "context_token_len":39,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":172,
    "context":"alternate_viewpoints_perspectives: 1. \/u\/fluffhoof makes a great solution to that problem which I support and find it way better then the current set up in the country. The country should be separated from the state and should not be able to give out marriage licences it should only be called a civil union for everyone. And if you choose to go further and receive a marriage through the church that is then up to you it does not force anything unwanted on any groups it is actually a great solution. 2. That is the issue that I'm saying needs to be fixed a civil union isn't equal and should be changed to be fair to everyone.",
    "question":"What about people who have contracted a civil union abroad?",
    "context_token_len":126,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":173,
    "context":"alternate_viewpoints_perspectives: I see an unfortunate trend amongst many people. People nowadays seem to think that having opinions which are edgy and go for shock value are a inately a good thing. This trend seems to be most apparent among the young. I think the increasing trend of brash and \"non-pc\" opinions is partly due to a desperate yearning to be seen as cool or not seem like a \"square\". They think by saying and doing things which can be perceived as being \"offensive\" they become apart of a cool, rebelious minority who go against established norms on how to conduct oneself. In my opinion , this couldnt be anymore wrong , because nowadays being edgy and controversial puts you in the majority group. What's even worse is quite often this desire to be edgy and push the boundaries crosses over in to clear bigotry. When you make it a virtue to be offensive and not \"Politically Correct\" you are bound to say and do blantantly racist\/bigoted things and anybody who calls you out for it is a boring , boot licker.",
    "question":"Are some against political correctness also bigots?",
    "context_token_len":205,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":174,
    "context":"alternate_viewpoints_perspectives: I've seen a lot of talk lately about people being upset that companies are only just now supporting LGBT people, because it's legal for them to marry (in America at least) and it's \"okay\" to advertise to them now, because it shows they don't really care and just want their money. I'm okay with this. Really, I don't think any company has ever REALLY cared about any specific demographic as long as they're getting money, but I'm more okay with it because it normalizes the LGBT experience.",
    "question":"What about a company like youtube that actively demonetizes content aimed at LGBT people and ignores rampant homophobia and transphobia on their site?",
    "context_token_len":108,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":6.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":175,
    "context":"alternate_viewpoints_perspectives: you are lumping all of the west in with a vocal minority that are mostly just trying to veil their hatred of Islam. Based on my experience in the west you are right that it is a minority that have a strong hatred of Islam and sharia but the majority also have a warped view of it, influenced by the \"vocal minority\" most people ive met do view sharia as backwards. Most western nations explicitly forbid the mixing of religion and law in some fashion, so Islamic or not, a religiously based law is frowned upon. The us certainly does officially have sepertation of church and state but most European counties have an official state Christian Church.",
    "question":"Are there official churches in other European countries?",
    "context_token_len":129,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":176,
    "context":"alternate_viewpoints_perspectives: I believe America is the best country in the world because no country in the world is perfect, however America provides the avenues and rights for one to make his or her voice heard and incite change regardless of society's consensus. Another point is that this is really the land of opportunity.",
    "question":"And there are no other countries that provide this opportunity?",
    "context_token_len":58,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":177,
    "context":"alternate_viewpoints_perspectives: I’m not familiar with the Canadian constitution, but because it makes discrimination based on gender identity a protected class like race, they are going to be handled the same way. There are people that believe if you don’t know every single kind of pronoun that exists and use it properly you are doing violence against them, sure. Just like how there are people who want to exterminate the white race because of their injustices. These people are very, VERY few and far between and no one making legislation or anyone reasonable in politics believes that. Emphasizing this small minority as a huge risk creates a problem, namely, it overshadows the actual purpose of the legislation and the really harmful experiences that people have on the basis of their gender identity. I’m sure we can agree that barring non-binary people from university is wrong. That makes the bill a bad place to draw the line.",
    "question":"Or the people protesting the bill is ridiculous?",
    "context_token_len":174,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":178,
    "context":"alternate_viewpoints_perspectives: I can get more specific as your questions get more specific. The biblical account of history claims that the Earth was created roughly 6,000 years ago. Virtually every method of dating this planet's age agrees with that, the only exception being the method of radiometric dating.",
    "question":"Are there any other methods of dating that are as accurate?",
    "context_token_len":53,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":5.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":179,
    "context":"alternate_viewpoints_perspectives: No. Citizenship is different from permanent residency. Open borders refers to a policy of granting permanent resident status to an unlimited number of people via a simple and quick application so long as they meet very basic criteria.",
    "question":"Are there any countries that have a policy of world wide open borders?",
    "context_token_len":43,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":180,
    "context":"alternate_viewpoints_perspectives: A plea bargain literally is, do or say what we want and here is the deal we will offer you for complying. How does that incentivize people to tell the truth and ultimately reach justice for all parties involved.",
    "question":"How about in situations where the defendant is pretty sure they will be convicted?",
    "context_token_len":44,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.5,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":181,
    "context":"alternate_viewpoints_perspectives: No, not universally. Some people might hate the Godfather and some others might love The Room. I love the dancing of Iggy Pop and James Brown on stage, and they basically just flailed around like mentally disturbed animals",
    "question":"But are some people bad at dancing?",
    "context_token_len":44,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":5
  },
  {
    "id":182,
    "context":"alternate_viewpoints_perspectives: The Watt (W) unit is a measure of power. It is equivalent to 1 Joule \/ second (J\/s). Watt-hour (Wh) is commonly used to measure energy. It is equivalent to 3.6 kJ. My view is that using J\/s instead of W, and J instead of Wh is superior in all cases in 2021. Why I have this view: We use W to measure power, and Wh to measure energy. This is confusing for both practitioners and students, who often mistake Wh for W\/h which of course makes no sense. If we used J and J\/s instead of Wh and W, the analogy with distance and speed would be much clearer and it would make power and energy calculations more intuitive and beginner-friendly.",
    "question":"What about replacing the Newton with kilogram meters per second per second?",
    "context_token_len":154,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":183,
    "context":"alternate_viewpoints_perspectives: Notice your implicit bias. You are very worried about sexism towards white men. There's nothing wrong with that. I'm spanish\/black and gay. So whenever I hear a racist or homphobic joke I tend to immediately get worried and protective. That's not something you have to deal with. Whenever someone tells a gay joke I have to try to figure out if this person is actually homophobic or if its just a joke. Even if it is just a joke.",
    "question":"What about a straight comedian?",
    "context_token_len":94,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":184,
    "context":"alternate_viewpoints_perspectives: The thing is the Thor example and Black Panther example are not the same. Thor being Gay or Straight has no bearing on the character's story and identity.",
    "question":"But female thor is a change in identity no?",
    "context_token_len":33,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":185,
    "context":"alternate_viewpoints_perspectives: Why? -Our use of resources is seriously harming other species' rights to existence and may be foreclosing the possibility of any other species achieving sentience and being able to build a civilization. A Planet of the Apes future where the chimps and bonobos rebuild society is increasingly unlikely. -We have divorced ourselves from the natural world and are turning the earth into a lifeless rock (the Venus scenario of global warming, for one). Even the Greeks, Romans, Aztecs, Chinese, Medieval Europeans, Byzantines, Caliphs, recognized themselves as a part of nature and were as \"natural\" and \"tree-hugging\" as the Magical Amerindians. -We have proven ourselves incompetent and incapable of organizing a society. -We have shown ourselves to be remarkably malicious and amoral among the large mammals.",
    "question":"How are other mammals more moral than us?",
    "context_token_len":151,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":186,
    "context":"alternate_viewpoints_perspectives: Those holes don't exist outside of the extreme though... You are comparing impossibility to possibility. The only difference is you are placing zero weight on someone else's belief that giving up an organ is paramount to the greatest thing anyone could possibly give in their life, and you're just making petty examples out of it to try and disvalue the weight on it.",
    "question":"Are you also against donating blood?",
    "context_token_len":72,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":0.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":187,
    "context":"alternate_viewpoints_perspectives: Context matters. People weren't proudly waving the Confederate flag continuously after the South lost the civil war to support \"southern pride\" or \"states rights\". It didn't come back into Vogue until the 1950s and 60s as a reaction to the civil Rights movement. From Wikipedia. The modern display of flags used by and associated with the Confederate States of Americastarted in response to the African-American civil rights movement in the 1950s and 1960s and continues into the present day. Their revival began with Senator Strom Thurmond's Dixiecrats in reaction to growing public support for racial equality, alongside opposition to civil rights in 1948. [1][2] While the US hasn't exactly been a beacon of liberty or justice for it's existence, that is what the flag symbolizes for many people, even if the government hasn't always lived up to the standard.",
    "question":"What about a flag like the Texas state flag?",
    "context_token_len":165,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":4.0,
    "ExpertOpinion":2.0,
    "FearAppeal":2
  },
  {
    "id":188,
    "context":"alternate_viewpoints_perspectives: Yes. Storage should be part of training requirements at the very least I also think the federal government could incentivize the purchase of gun safes so more people buy them. Maybe offer tax credits or subsidize the cost of purchase.",
    "question":"How about just mandating them like in developed countries?",
    "context_token_len":45,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":189,
    "context":"alternate_viewpoints_perspectives: Son, you have not cited a single scientific fact, study, or even a sourced article. You believe that nature acts with intent, despite all scientific evidence to the contrary.",
    "question":"What other evidence do you need to show that the intention of nature is to promote sustainable life?",
    "context_token_len":37,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":4.0,
    "ExpertOpinion":5.0,
    "FearAppeal":2
  },
  {
    "id":190,
    "context":"alternate_viewpoints_perspectives: You know... just in case. We're killing them either way and we might just solve like droughts or covid-19 doing this. Also from the prisoners point of view, compared to lethal injection, I'd feel better and less terrified about my death if I was cleaned and had a nine in blade plunged into my heart in praise of Anubis. It certainly beats being strapped to a hospital bed while being surrounded by a bunch of people who aren't doctors but dressed up as doctors preparing to dope you out, paralyze you and then end your life in the name of revenge for something you did twenty years ago. I am completely serious. How is this not the greatest idea in the world, obviously if someone didn't wish to be sacrificed to some badass god like Yama they wouldn't have to. Though I'm sure we can find the right deity for most every prisoner.",
    "question":"What about people who are on death row for performing a human sacrifice?",
    "context_token_len":173,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":5
  },
  {
    "id":191,
    "context":"alternate_viewpoints_perspectives: When a man is charged with distributing nude pictures of a 14 year old girl, that man can be get huge fines and years of jail and be branded a sex offender for life, basically ruining his entire life. However, once a girl is 18, she can literally be in porn that is distributed to the entire world with no penalty. Just go on Brazzers. You'll see not a small amount of girls who are 18 in the scene. Yet the differnces in bodies of 14 and 18 year old girls are negligble. I'm not saying they are the same. Of course the 18 year old girl's body is more matured, as well as the girl's mind.",
    "question":"Are some people mature sooner?",
    "context_token_len":135,
    "is_Critical":false,
    "CauseToEffect":3.5,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":3
  },
  {
    "id":192,
    "context":"alternate_viewpoints_perspectives: So, I am probably going to get downvoted for this, but I genuinely don't understand this whole concept. Why would anybody consider religion to be part of their identity? It is a set of claims about the universe, spirituality, ethics, God, supernatural elements etc. Why would anybody make a bunch of claims part of their identity? Isn't that a bit like considering being a humanist part of your identity? To my knowledge, nobody does that, but with religion it's considered normal. Why? Why become so emotionally attached to a bunch of claims that you consider it to be a \"fundamental part of them\".",
    "question":"What else is there to base your personality around that has such a solid foundation?",
    "context_token_len":126,
    "is_Critical":false,
    "CauseToEffect":4.0,
    "Analogy":3.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  },
  {
    "id":193,
    "context":"alternate_viewpoints_perspectives: Personally, I believe that saying the n word isn't racist if there isn't any racist intent behind it. I know many people believe that it is only racist if a non-black person says it but I disagree. I believe that you can be racist to your own race. I'm Indian, but if I said that I hate all Indians, and that they were all stupid I would be racist. Saying a phrase and being called racist when you're one race, but not called racist when you're another race is racist. I know their is history behind the term, but if you don't like the phrase, don't use it and don't be around people who do use the phrase.",
    "question":"What other reason could they have for using the word?",
    "context_token_len":142,
    "is_Critical":false,
    "CauseToEffect":2.0,
    "Analogy":3.5,
    "ExpertOpinion":1.0,
    "FearAppeal":3
  },
  {
    "id":194,
    "context":"alternate_viewpoints_perspectives: I don't think that's necessarily true. People can embrace some traditions but not others, and what I find problematic about this particular tradition is that it is automatically the girl's family name that gets lost. I can get married and have a non-traditional wedding, or choose to keep the traditions we don't object to.",
    "question":"But does an extravagant wedding?",
    "context_token_len":67,
    "is_Critical":false,
    "CauseToEffect":0.0,
    "Analogy":2.0,
    "ExpertOpinion":0.0,
    "FearAppeal":2
  }
]